#### VertexStreamPositionColored Members

---

|  |
| --- |
| VertexStreamPositionColored Class   Methods   Properties   See Also |

The  VertexStreamPositionColored  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddVertex | Inserts a  VertexStreamPositionColored  into the stream and associated buffer. |
| Public method | AddVertices | Inserts multiple  VertexStreamPositionColored  instances into the stream and associated buffer. |
| Public method | Dispose | (Inherited from  VertexStream  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  VertexStream  .) |

# See Also

VertexStreamPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace